tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "r-lib/rig"
tap "romkatv/powerlevel10k"
brew "act"
brew "python@3.11"
brew "ansible", link: false
brew "libpng"
brew "webp"
brew "awscli"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "freetype"
brew "harfbuzz"
brew "bfg"
brew "caddy"
brew "ccache"
brew "checkbashisms"
brew "coreutils"
brew "docker"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "unbound"
brew "gnupg"
brew "go"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jags"
brew "jpeg"
brew "jq"
brew "lazygit"
brew "libxml2"
brew "llvm"
brew "neovim"
brew "node"
brew "openblas"
brew "pandoc"
brew "tree"
brew "pass"
brew "pinentry-mac"
brew "poppler"
brew "powerlevel10k"
brew "pyenv"
brew "tcl-tk"
brew "r"
brew "rclone"
brew "ripgrep"
brew "terraform-docs"
brew "terragrunt"
brew "texlive"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "unixodbc"
brew "vim"
brew "yadm"
brew "zlib"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
cask "alfred"
cask "dozer"
cask "flycut"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "inkscape"
cask "mactex"
cask "obsidian"
cask "rectangle"
cask "rig"
cask "rstudio"
cask "slack"
cask "stats"
cask "unity-hub"
cask "vagrant"
cask "vagrant-vmware-utility"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "zotero"

