brew "ccache"     # Object-file caching compiler wrapper
brew "coreutils"  # GNU File, Shell, and Text utilities
brew "gfortran"   # GNU compiler collection
brew "graphviz"   # Graph visualization software from AT&T and Bell Labs
brew "libgit2"    # C library of Git core methods that is re-entrant and linkable
brew "libjpeg"    # Image manipulation library
brew "libomp"     # LLVM's OpenMP runtime library
brew "libxml2"    # GNOME XML library
brew "llvm"       # Next-gen compiler infrastructure
brew "openblas"   # Optimized BLAS library
brew "openssl"    # OpenSSL GIO module for glib
brew "poppler"    # PDF rendering library (based on the xpdf-3.0 code base)
brew "readline"   # Library for command-line editing
brew "unixodbc"   # ODBC 3 connectivity for UNIX
brew "xz"         # General-purpose data compression with high compression ratio
brew "zlib"       # General-purpose lossless data-compression library
brew "r"
cask "rstudio"

