tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "r-lib/rig"
tap "romkatv/powerlevel10k"
brew "ccache"
brew "coreutils"
brew "gcc"
brew "gh"
brew "git"
brew "graphviz"
brew "htop"
brew "jpeg"
brew "libgit2"
brew "libomp"
brew "libxml2"
brew "llvm"
brew "neovim"
brew "openblas"
brew "openssl@3"
brew "pandoc"
brew "poppler"
brew "pyenv"
brew "r"
brew "tldr"
brew "tmux"
brew "tree"
brew "unixodbc"
brew "vim"
brew "yadm"
brew "zlib"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "alfred"
cask "dozer"
cask "flycut"
cask "font-hack-nerd-font"
cask "obsidian"
cask "rectangle"
cask "rig"
cask "rstudio"
cask "slack"
cask "stats"
cask "visual-studio-code"
cask "zotero"
